Public Attributes | List of all members
API_NewWindowPars Struct Reference
Window Management
Parameters to open a new window. More...
#include <APIdefs_Database.h>
 Public Attributes
API_WindowTypeID  | typeID
type of the database; only APIWind_MyTextID and APIWind_MyDrawID are allowed.
API_Guid  | userRefId
free to use identifier of the window. Returned in notifications.
bool  | useOriginalPenWeight
The window uses original weight of pen attributes at line drawing instead of hairline.
GS::uchar_t  | wTitle [API_UniLongNameLen]
The window title (Unicode string).
GS::uchar_t  | wFile [API_UniLongNameLen]
The file name of the window.
Detailed Description
Parameters to open a new window.
Remarks
Refer to the ACAPI_Window_NewWindow function for more details.
Member Data Documentation
◆ typeID
 API_NewWindowPars::typeID
type of the database; only APIWind_MyTextID and APIWind_MyDrawID are allowed.
◆ useOriginalPenWeight
 API_NewWindowPars::useOriginalPenWeight
The window uses original weight of pen attributes at line drawing instead of hairline.
◆ userRefId
 API_NewWindowPars::userRefId
free to use identifier of the window. Returned in notifications.
◆ wFile
 API_NewWindowPars::wFile
The file name of the window.
◆ wTitle
 API_NewWindowPars::wTitle
The window title (Unicode string).